{"name":"","children":[{"name":"Awareness and decision making","children":[{"name":"Awareness and decision making","children":[{"tier1":"Awareness and decision making","category":"Awareness and decision making","name":"Convene national security council","description":"As POTUS, national security is obviously one of my primary concerns. And while I recieve daily security briefings, I also regularly meet with the top leaders of our armed forces to be briefed on the general state of national security or to vet a specific issue or threat. THis is typically in a secure meeting room with the leaders present or live on screen. I hear updates and perspectives from various particpants, ask some clarifying questions, then am typically asked to make a decision about the action we should take.","level":5},{"tier1":"Awareness and decision making","category":"Awareness and decision making","name":"Meet with key staff members on key issues and decisions","description":"At the core of my role is staying informed and making decisions and I rely heavily on my cabinet members and key staff for this. This is a one-on-one or small group discussion, often in the Oval office but sometimes over the phone, where they brief me on a key issue, I ask some clarifying questions and offer some feedback, then I'm usually asked to make a decision.","level":2},{"tier1":"Awareness and decision making","category":"Awareness and decision making","name":"Receive the Presidential daily briefing","description":"Every morning, right after I review my daily schedule, I'm given the daily intelligence briefing about national security. I listen to the issues presented, hear opinions and perspectives from key staff, ask clarifying questions and then usually make a couple decisions about next steps or to select some of the options presented to me.","level":3},{"tier1":"Awareness and decision making","category":"Awareness and decision making","name":"Review daily schedule","description":"As soon as I get to the Oval Office in the morning I do a run down of my daily schedule with my personal secretary. She tells me what's currently planned, I ask a few questions, and sometimes suggest a few changes. It takes about 10-15 minutes and is a quick back and forth.","level":3}]}]},{"name":"Campaigning","children":[{"name":"Campaigning","children":[{"tier1":"Campaigning","category":"Campaigning","name":"Deliver remarks at campaign event","description":"As POTUS I carry some of the greatest political weight of any current figure in American politics, so I try to put that capital to work in support of my party and agenda. This means showing up at a political rally to say a few words and endorse a candidate for office. I'm usually in and out of the event itself in 1 or 2 hours. It's a little bit of speaking and a little bit of hand-shaking and small talk.","level":6},{"tier1":"Campaigning","category":"Campaigning","name":"Deliver remarks at convention","description":"As POTUS I have the opportunity to speak at large events to large crowds on a range of different issues, such as security, economics, social issues, politics, foreign affairs, etc. I typically have my remarks drafted for me, with plenty of my own input. I'm in and out of the event in a few hours tops. I get on stage, give an engaging speech, usually with a teleprompter, then head out. Usually there are a few meet and greets back stage with key people on the way in and out.","level":2},{"tier1":"Campaigning","category":"Campaigning","name":"Deliver remarks at reception","description":"Private receptions are a staple of the campaign trail and as POTUS this is an important channel to moving our agenda forward and securing current and future political leadership for the party. Usually it's a black tie event and I can be there for 1 or 2 hours. It involves some dining and polite small talk. Then I get in front of the room to deliver some remarks that address the subject of the event and often any current issues that are relevant or important, as well as endorsing the person for whom the event was organized.","level":6},{"tier1":"Campaigning","category":"Campaigning","name":"Participate in party roundtable","description":"Roundtable events are an important way to bring in outside voices our specialized viewpoints to the discussion and platform of our political party. These are held live or virtually and involve around a dozen participants from business, social, religious, cultural, or other arenas. I help facilitatie a discussion where I ask and answer questions. It lasts for an hour or two at the most.","level":2}]}]},{"name":"Commander in chief","children":[{"name":"Commander in chief","children":[{"tier1":"Commander in chief","category":"Commander in chief","name":"Deliver remarks to military","description":"As the commander-in-chief of the military forces for the United States of America I talk to our service men and women on a regular basis. This is usally an in person speech at a military event on base or in the field. Like my other engagements delivering remarks, I'm in and out of the actual event in an hour or two, often with some meet and greet before and after. I get up on stage and deliver some prepared remarks that I've reviewed en route to the event, occasionally with some improvised remarks as well.","level":3}]}]},{"name":"International relations","children":[{"name":"International relations","children":[{"tier1":"International relations","category":"International relations","name":"Attend state dinner","description":"As the head of state I host foreign dignitaries in order to build and manage relations between our nations. These are typically black tie events at the White House that last several hours involving conversation before, during, and after dinner. Occasionally there is entertainment and I always say a few words and toast our guests. Observing the customs and cultural ettiquite of our guests is an important aspect of these engagements.","level":3},{"tier1":"International relations","category":"International relations","name":"Deliver remarks at international relations event","description":"In order to manage international relations outside of formal discussions with heads of state, I will attend events like business conferences or Davos, for example. I rehearse and present some prepared remarks on topics relevant to the event and the agenda of the United States. THese are more formal presentations and involve some individual conversations and meet and greets before and after the prepared remarks on stage.","level":3},{"tier1":"International relations","category":"International relations","name":"Deliver remarks to United Nations","description":"When there are key issues in the United Nations that require significant visibility or political capital, I will deliver remarks to the General Assembly of the United Nations. This takes place at the United Nations building. The remarks last 10-20 minutes and I usually have some individual meetings with leaders before and after given the convienience of being in the same room. Traffic on the Upper East Side is usually a total mess for the whole day.","level":4},{"tier1":"International relations","category":"International relations","name":"Discuss urgent issues over the phone with heads of state","description":"Most issues of state are addressed in formal, in-person meetings and bi-lateral talks. On occasion, however, there are urgent issues that can't wait (often at odd hours due to the international time differences.) I'm usually alerted to the issue and briefed by my staff, we have a quick conversation to determine our approach to the conversation, then I'm given the phone with the head of state on the other end. We discuss the issue and try and come to agreement as quickly and amicably as we can, then determine next steps on either side, to the degree they are warranted. After the call I do a quick debbrief with my staff as to the next actions we must take.","level":6},{"tier1":"International relations","category":"International relations","name":"Hold bi-lateral meeting with state dignitaries","description":"Where treaties and international agreements are concerned, these are typically hashed out in live, physical meetings between the staff of both offices. These typically are structured in stretches of a few hours of group negotiation that take place over a few days, either at the White House or the state offices of the other party. We review agendas and intended goals, debate the issues and negotiate terms. Ideally we end up with results that work for both sides and hold a press conference to share the results.","level":5},{"tier1":"International relations","category":"International relations","name":"Hold joint press conference with dignitaries","description":"When we meet with state dignitaries the press wants to know what's going on. Typically we hold a brief press conference at the beginning and end of the visit, first to outline our hopes and agendas, and then to share the outcomes of the visit. I deliver some prepared remarks and both of us answer questions from the press. It lasts no more than 30 minutes in a very crowded, noisy press room with lots of lights and cameras.","level":6},{"tier1":"International relations","category":"International relations","name":"Take official photos with state dignitaries","description":"The press needs photos and the White House wants to present a positive image of cooperation with foreign nations, so photo ops are a big part of that. This happens as part of the visit from state dignitaries and often at the press conferences at the beginning and end of the visit. Basically you shake their hand and look at the wall of cameras from the press and make a smile of appropriate, dignified enthusiasm. It seems simple, but there really is an art to it, both physically and emotionally, to embodying the right tone of diplomacy and power.","level":3},{"tier1":"International relations","category":"International relations","name":"Welcome state dignitaries","description":"When state dignitaries visit, it's my job as Head of State to provide a formal welcome, as any good host should do. When they arrive at the White House I greet them, sometimes with members of my family, with kind words and appropriate small talk as we walk to either their guest rooms or the location of the next event. On occasion we exchange gifts, typically of cultural importance or significance. Understanding acceptable social graces of different societies plays an important role in this engagement.","level":3}]}]},{"name":"Political discourse","children":[{"name":"Political discourse","children":[{"tier1":"Political discourse","category":"Political discourse","name":"Meet with congressional leaders","description":"The White House and my political party has an agenda and Congress is, obviously, a critical channel to moving that agenda forward. This engagement involves meeting with the majority leaders of both the House and the Senate, usually as a sit down in the Oval Office to discuss the topic at hand. I'm either setting the agenda or they are bringing an issue to me. I'm briefed by my staff ahead of the meeting and have a sense of how I want to direct the meeting. During the meeting I'm listening to their positions and concerns, sharing my own and asking clarifying questions. We try to reach some consensus on the issue, whether that's legislation or a political concern with the activities and agenda of the White House.","level":4}]}]},{"name":"Publicity and communications","children":[{"name":"Publicity and communications","children":[{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Attend public state event","description":"As the symbol of America abroad, I attend important state events such as funerals or weddings or memorials. On occasion I deliver remarks but I'm most there to pay respects on behalf of the United States of America and the according visibility required to do that in the public eye. The events last a couple hours. There is a lot of intimate social engagement that requires the appropriate tone depending on the occasion, and observing local customs is very important. I also need to know the right context around the event, so I need to be briefed (I can't know everything all the time!) and then speak fluently about the issue in an authentic way.","level":5},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Be interviewed on news show","description":"Engaging with the media is a central role of being POTUS and I will occasionally go on Meet The Press or another news show to dicsuss important issues. The engagement takes about an hour. It starts with arriving at the set, discussing the questions with the news staff and my own staff, then a bit of makeup. The shoot happens and I answer questions on camera, some of which I'm hearing for the first time, and answer as clearly and gracefully as I can, getting my own point while being mindful of where the host wants to take the conversation. Then the cameras stop, I make my thank yous and goodbyes and it's on to the next engagement.","level":6},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Be interviewed on scripted entertainment TV show","description":"Entertainment is another channel for connecting with the American people and moving our agenda forward, so occasionally I'll be a guest on a talk show or comedy show. Whereas news shows usually involve live dialog, these shows are typcially scripted or much more controlled. I show up on set before the taping, meet the host and discuss the questions or format, then get a little makeup. On set, the cameras roll and I interact with the host according to the plan, typically answering some questions in a light but thoughtful manner. Comic timing and a subtle display of emotion come in handy here. Things usually wrap up after an hour and I'm on to the next event.","level":3},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Deliver remarks about policy or legislation","description":"Important issues of policy require clear communication and repetition to different audiences, so I deliver remarks on these issues at a lot of different functions and to a lot of different audiences. I usually deliver prepared remarks at a live event to an audience that can last anywhere from 5 minutes to 30 minutes. I usually read through the remarks on the way to the event and run over some tricky phrasing to make sure I'm comfortable with it, or suggest some last minute edits.","level":5},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Deliver remarks at a conference","description":"Delivering remarks is a key part of communicating the agenda and issues of the White House. This often happens in large scale conference events. The remarks are prepared by my staff, with input from me before hand. I get ready back stage, talking with some staff and the event hosts just to get loose. Then I step onto a large stage in a very crowded and noisy conference hall and deliver the remarks both to the audienc and to the cameras that are projecting close up shots. Then I try to make a smooth exit, thank the staff and hosts and it's on to my next engagement.","level":3},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Deliver remarks at press event","description":"I engage with the press on a regular basis, most often at the White House press room but also on the road. This is a very loud, chaotic, and busy engagement where I deliver some prepared remarks on a specific issue, then usually take some questions from individual reporters. Then I wrap it up with an exiting remark and often let my press secretary take over for any remaining questions. Occasionally I don't have time for questions and so just deliver a statement, though the energy and environment are just as intense.","level":3},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Deliver remarks at televised event","description":"On rare occasions I address the American people directly through a televised statement, often from the Oval Office or another location in the White House. Because of the intimate nature of how these statements are received (televised close-ups) I have to be comfortable looking right into the camera and careful with my display of emotion. The remarks are usually on a teleprompter right next to the camera. The remarks usually last less than 10 minutes, but it's a very intense 10 minutes knowing that you are being broadcast live to tens of millions of Americans and others across the globe. Even the strongest anti-persperent comes up a bit short.","level":4},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Hold meet and greet with local public on location","description":"I travel around the country to view important projects, recognize events, and review local and national crises. When I'm on the ground I like to meet with locals, hear their stories, answer some questions and share a few words in an intimate setting. This is sometimes in a more structured indoors setting where the emphasis is more on discussion. At other times it's on location outdoors or in a more challenging environment where the emphasis is on observing the surroundings and activity, so conversations and interactions are more improvised and ad hoc.","level":6},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Meet with honorees","description":"As head of state I will occasionally meet with national honorees such as olympic team members, artists, activists, and others who have made important achievements and contributions. I greet them in the White House, ask a few questions and hear their stories, then usually do a few photo ops and congratulate them on their accomplishments on behalf of the American people.","level":3},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Participate in conference call with public advocates and leaders","description":"In order to stay informed on important issues and help facilitate decision-making I will occacionally hold a conference call with public advocates and leaders on those issues. These calls last 30-60 minutes and I take them from the comfort of the Oval Office if I can. I listen to the perspectives of the different participants, ask some questions and answer a few as well.","level":3},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Participate in roundtable discussion with business leaders","description":"Another means of staying informed--and informing others--on key issues is to hold live roundtable discussions. These are live conversations with a small group of key leaders, either from business, state, or social topics. They take place in a meeting room at the White House or on location while travelling. I engage in open dialog around a key topic, asking and aswering questions, trying to facilitate the sharing of viewpoints and, as appropriate, clarifying and projecting my own.","level":4},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Bestow honors at state ceremonies","description":"POTUS is traditionally called upon to bestow certain national honors such as the Kennedy Center artist awards, the national medal of honor, and other key state awards. As head of state my role is to officiate these ceremonies, which typically last an hour or two and involve me saying a few words to each recipient as I hand them an award at a public ceremony. Often these are held at the White House or ceremonial location in Washington DC.","level":6},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Participate in televised town hall conversation","description":"It's important to field questions directly from the American people on occasion in order that they might feel heard on key issues and our position and agenda on those issues can be known. These events last a couple hours either at a television studio or on location at the White House or a college campus with a full production crew. It's a live event where I am fielding questions, typically screened to a certain degree, and responding to them in the moment, speaking directly to the person asking the question. It's important to address the question in away that is specific to their interest yet general enough to have meaning to the broader American people.","level":4},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Visit and tour project sites","description":"Whether a national disaster, public infrastructure, or government work project, a big part of my role is getting out of the office and surveying the scene on location. After traveling to the site, my team and I meet with a few individual contacts who then walk us through the site and describe the project or situation while we ask and answer questions from them and from any people we meet. There are usually photo ops and press along for the ride, so managing our conversation and images carefully are an important aspect of these engagements.","level":5},{"tier1":"Publicity and communications","category":"Publicity and communications","name":"Deliver state of the union address","description":"One of the key responsibilities of POTUS is to deliver to Congress a state of the union, which I do each year. After days and even weeks of preparation with my staff I enter the floor of the House of Representatives, which is very crowded and energetic and involves a lot of hand-shaking, and approach the podium. I then deliver a prepared address that lasts about an hour, then I leave the chambers to the same chaotic hand-shaking as when I arrived.","level":3}]}]}]}